tap "caskroom/cask"
tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/versions"

# Command line
brew "fish"
brew "git"
brew "jq"
brew "md5sha1sum"
brew "nginx"
brew "p7zip"
brew "sshuttle"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "wget"
brew "openssl"
brew "htop"
cask "macpar-deluxe"

# Editors
brew "vim"
cask "visual-studio-code"
cask "intellij-idea-ce"
cask "bbedit"
cask "diffmerge"

# Languages
brew "go"
cask "java"
brew "gradle"
brew "protobuf"
brew "python3"
brew "node"

# Fonts
cask "caskroom/fonts/font-inconsolata-g-for-powerline"
cask "caskroom/fonts/font-dejavu-sans-mono-for-powerline"
cask "caskroom/fonts/font-source-code-pro"
cask "caskroom/fonts/font-fira-code"

# Apps
#cask "evernote"
#cask "sqlitebrowser"
cask "xmind"
cask "iterm2"
cask "superduper"
#cask "android-file-transfer"
cask "cerebro"
#cask "alfred"
#cask "dropbox"
cask "karabiner-elements"
cask "typora"
cask "spectacle"
cask "fluid"
cask "karabiner"
cask "onyx"
cask "smcfancontrol"
cask "intel-power-gadget"
cask "wireshark"

# Unproductivity
cask "spotify"
cask "vlc"
cask "aerial"
cask "handbrake"
cask "lastfm"
cask "piezo"

# Devtools
brew "hub"
brew "ansible"
cask "slack"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vagrant"
cask "docker"
cask "sourcetree"

# Browser
cask "google-chrome"
cask "google-hangouts"
cask "firefox"
