tap "zaquestion/tap"
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "launchdarkly/tap"
tap "ngrok/ngrok"
tap "zaquestion/tap"

# Command line
brew "gnu-tar"
brew "fish"
brew "fisher"
brew "git"
brew "git-gui"
brew "git-quick-stats"
brew "jq"
brew "httpie"
brew "md5sha1sum"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "wget"
brew "openssl"
brew "htop"
brew "cloc"
brew "hugo"
brew "poppler"
brew "xsv"

# Editors
brew "vim"
cask "visual-studio-code"
cask "cursor"
cask "hex-fiend"

# Languages
brew "go"
brew "python@3.10"
brew "node"
brew "ruby"
brew "rust"

# Fonts
cask "font-fira-code"
cask "font-cascadia-mono"
cask "font-monaspace"

# Apps
cask "db-browser-for-sqlite"
cask "superduper"
cask "alfred"
cask "dropbox"
cask "spectacle"
cask "menumeters"
cask "meetingbar"
cask "obsidian"
cask "menumeters"

# Unproductivity
cask "spotify"
cask "vlc"

# Devtools
brew "gh"
brew "terraform"
brew "packer"
brew "kubectl"
brew "kops"
brew "helm"
brew "awscli"
cask "session-manager-plugin"
brew "postgres"
brew "terminal-notifier"
cask "insomnia"
brew "bbe"
brew "cmake"
brew "xsv"
brew "ffmpeg"
cask "ghostty"
cask "hex-fiend"
cask "ngrok"
cask "mactex"

# Dash Provided
#cask "slack"
#cask "google-chrome"
#cask "zoom"
#cask "docker"

